scripts/console_register.yml
config:
  target: http://localhost:7000 #API endpoint
  phases:
    - duration: 10
      arrivalCount: 1
  variables:
    email: $faker.internet.email
    firstName: $faker.name.firstName
    lastName: $faker.name.lastName

scenarios:
  - name: "Create a user account"
    flow:
      - post: 
          url: /auth/sign_up
          json:
            email: "{{ prefix }}{{ email }}"
            password: "{{ password }}"
            username: "{{ firstName }} {{ lastName }}"
            zoneName: "Asia/Bangkok"
          beforeRequest: hashPassword
          afterResponse: saveUserToFile